readme modification
